earlephilhower/arduino-pico/boards.txt
adafruitfeatherpicoprobe.pid.0=0x000b
adafruitfeatherpicoprobe.build.usbpid=-DSERIALUSB_PID=0x000b
adafruitfeatherpicoprobe.build.board=ADAFRUIT_FEATHER_RP2040
adafruitfeatherpicoprobe.build.mcu=cortex-m0plus
adafruitfeatherpicoprobe.build.variant=adafruitfeather
adafruitfeatherpicoprobe.upload.tool=picoprobe
adafruitfeatherpicoprobe.upload.maximum_size=8388608
adafruitfeatherpicoprobe.upload.maximum_data_size=262144
adafruitfeatherpicoprobe.upload.wait_for_upload_port=true
adafruitfeatherpicoprobe.upload.erase_cmd=
adafruitfeatherpicoprobe.serial.disableDTR=false
adafruitfeatherpicoprobe.serial.disableRTS=false
adafruitfeatherpicoprobe.build.f_cpu=125000000
adafruitfeatherpicoprobe.build.led=
adafruitfeatherpicoprobe.build.core=rp2040
adafruitfeatherpicoprobe.build.mcu=rp2040
adafruitfeatherpicoprobe.build.ldscript=memmap_default.ld
adafruitfeatherpicoprobe.menu.flash.8388608_0=8MB (no FS)
adafruitfeatherpicoprobe.menu.flash.8388608_0.upload.maximum_size=8384512
adafruitfeatherpicoprobe.menu.flash.8388608_0.build.flash_length=8384512
adafruitfeatherpicoprobe.menu.flash.8388608_0.build.eeprom_start=276819968
adafruitfeatherpicoprobe.menu.flash.8388608_0.build.fs_start=276819968
adafruitfeatherpicoprobe.menu.flash.8388608_0.build.fs_end=276819968
adafruitfeatherpicoprobe.menu.flash.8388608_65536=8MB (FS: 64KB)
adafruitfeatherpicoprobe.menu.flash.8388608_65536.upload.maximum_size=8318976
adafruitfeatherpicoprobe.menu.flash.8388608_65536.build.flash_length=8318976
adafruitfeatherpicoprobe.menu.flash.8388608_65536.build.eeprom_start=276819968
adafruitfeatherpicoprobe.menu.flash.8388608_65536.build.fs_start=276754432
adafruitfeatherpicoprobe.menu.flash.8388608_65536.build.fs_end=276819968
adafruitfeatherpicoprobe.menu.flash.8388608_131072=8MB (FS: 128KB)
adafruitfeatherpicoprobe.menu.flash.8388608_131072.upload.maximum_size=8253440
adafruitfeatherpicoprobe.menu.flash.8388608_131072.build.flash_length=8253440
adafruitfeatherpicoprobe.menu.flash.8388608_131072.build.eeprom_start=276819968
adafruitfeatherpicoprobe.menu.flash.8388608_131072.build.fs_start=276688896
adafruitfeatherpicoprobe.menu.flash.8388608_131072.build.fs_end=276819968
adafruitfeatherpicoprobe.menu.flash.8388608_262144=8MB (FS: 256KB)
adafruitfeatherpicoprobe.menu.flash.8388608_262144.upload.maximum_size=8122368
adafruitfeatherpicoprobe.menu.flash.8388608_262144.build.flash_length=8122368
adafruitfeatherpicoprobe.menu.flash.8388608_262144.build.eeprom_start=276819968
adafruitfeatherpicoprobe.menu.flash.8388608_262144.build.fs_start=276557824
adafruitfeatherpicoprobe.menu.flash.8388608_262144.build.fs_end=276819968
adafruitfeatherpicoprobe.menu.flash.8388608_524288=8MB (FS: 512KB)
adafruitfeatherpicoprobe.menu.flash.8388608_524288.upload.maximum_size=7860224
adafruitfeatherpicoprobe.menu.flash.8388608_524288.build.flash_length=7860224
adafruitfeatherpicoprobe.menu.flash.8388608_524288.build.eeprom_start=276819968
adafruitfeatherpicoprobe.menu.flash.8388608_524288.build.fs_start=276295680
adafruitfeatherpicoprobe.menu.flash.8388608_524288.build.fs_end=276819968
adafruitfeatherpicoprobe.menu.flash.8388608_1048576=8MB (FS: 1MB)
adafruitfeatherpicoprobe.menu.flash.8388608_1048576.upload.maximum_size=7335936
adafruitfeatherpicoprobe.menu.flash.8388608_1048576.build.flash_length=7335936
adafruitfeatherpicoprobe.menu.flash.8388608_1048576.build.eeprom_start=276819968
adafruitfeatherpicoprobe.menu.flash.8388608_1048576.build.fs_start=275771392
adafruitfeatherpicoprobe.menu.flash.8388608_1048576.build.fs_end=276819968
adafruitfeatherpicoprobe.menu.flash.8388608_2097152=8MB (FS: 2MB)
adafruitfeatherpicoprobe.menu.flash.8388608_2097152.upload.maximum_size=6287360
adafruitfeatherpicoprobe.menu.flash.8388608_2097152.build.flash_length=6287360
adafruitfeatherpicoprobe.menu.flash.8388608_2097152.build.eeprom_start=276819968
adafruitfeatherpicoprobe.menu.flash.8388608_2097152.build.fs_start=274722816
adafruitfeatherpicoprobe.menu.flash.8388608_2097152.build.fs_end=276819968
adafruitfeatherpicoprobe.menu.flash.8388608_3145728=8MB (FS: 3MB)
adafruitfeatherpicoprobe.menu.flash.8388608_3145728.upload.maximum_size=5238784
adafruitfeatherpicoprobe.menu.flash.8388608_3145728.build.flash_length=5238784
adafruitfeatherpicoprobe.menu.flash.8388608_3145728.build.eeprom_start=276819968
adafruitfeatherpicoprobe.menu.flash.8388608_3145728.build.fs_start=273674240
adafruitfeatherpicoprobe.menu.flash.8388608_3145728.build.fs_end=276819968
adafruitfeatherpicoprobe.menu.flash.8388608_4194304=8MB (FS: 4MB)
adafruitfeatherpicoprobe.menu.flash.8388608_4194304.upload.maximum_size=4190208
adafruitfeatherpicoprobe.menu.flash.8388608_4194304.build.flash_length=4190208
adafruitfeatherpicoprobe.menu.flash.8388608_4194304.build.eeprom_start=276819968
adafruitfeatherpicoprobe.menu.flash.8388608_4194304.build.fs_start=272625664
adafruitfeatherpicoprobe.menu.flash.8388608_4194304.build.fs_end=276819968
adafruitfeatherpicoprobe.menu.flash.8388608_5242880=8MB (FS: 5MB)
adafruitfeatherpicoprobe.menu.flash.8388608_5242880.upload.maximum_size=3141632
adafruitfeatherpicoprobe.menu.flash.8388608_5242880.build.flash_length=3141632
adafruitfeatherpicoprobe.menu.flash.8388608_5242880.build.eeprom_start=276819968
adafruitfeatherpicoprobe.menu.flash.8388608_5242880.build.fs_start=271577088
adafruitfeatherpicoprobe.menu.flash.8388608_5242880.build.fs_end=276819968
adafruitfeatherpicoprobe.menu.flash.8388608_6291456=8MB (FS: 6MB)
adafruitfeatherpicoprobe.menu.flash.8388608_6291456.upload.maximum_size=2093056
adafruitfeatherpicoprobe.menu.flash.8388608_6291456.build.flash_length=2093056
adafruitfeatherpicoprobe.menu.flash.8388608_6291456.build.eeprom_start=276819968
adafruitfeatherpicoprobe.menu.flash.8388608_6291456.build.fs_start=270528512
adafruitfeatherpicoprobe.menu.flash.8388608_6291456.build.fs_end=276819968
adafruitfeatherpicoprobe.menu.flash.8388608_7340032=8MB (FS: 7MB)
adafruitfeatherpicoprobe.menu.flash.8388608_7340032.upload.maximum_size=1044480
adafruitfeatherpicoprobe.menu.flash.8388608_7340032.build.flash_length=1044480
adafruitfeatherpicoprobe.menu.flash.8388608_7340032.build.eeprom_start=276819968
adafruitfeatherpicoprobe.menu.flash.8388608_7340032.build.fs_start=269479936
adafruitfeatherpicoprobe.menu.flash.8388608_7340032.build.fs_end=276819968
adafruitfeatherpicoprobe.menu.freq.125=125 MHz
adafruitfeatherpicoprobe.menu.freq.125.build.f_cpu=125000000L
adafruitfeatherpicoprobe.menu.freq.50=50 MHz
adafruitfeatherpicoprobe.menu.freq.50.build.f_cpu=50000000L
adafruitfeatherpicoprobe.menu.freq.100=100 MHz
adafruitfeatherpicoprobe.menu.freq.100.build.f_cpu=100000000L
adafruitfeatherpicoprobe.menu.freq.133=133 MHz
adafruitfeatherpicoprobe.menu.freq.133.build.f_cpu=133000000L
adafruitfeatherpicoprobe.menu.freq.150=150 MHz (Overclock)
adafruitfeatherpicoprobe.menu.freq.150.build.f_cpu=150000000L
adafruitfeatherpicoprobe.menu.freq.175=175 MHz (Overclock)
adafruitfeatherpicoprobe.menu.freq.175.build.f_cpu=175000000L
adafruitfeatherpicoprobe.menu.freq.200=200 MHz (Overclock)
adafruitfeatherpicoprobe.menu.freq.200.build.f_cpu=200000000L
adafruitfeatherpicoprobe.menu.freq.225=225 MHz (Overclock)
adafruitfeatherpicoprobe.menu.freq.225.build.f_cpu=225000000L
adafruitfeatherpicoprobe.menu.freq.250=250 MHz (Overclock)
adafruitfeatherpicoprobe.menu.freq.250.build.f_cpu=250000000L
adafruitfeatherpicoprobe.menu.freq.275=275 MHz (Overclock)
adafruitfeatherpicoprobe.menu.freq.275.build.f_cpu=275000000L
adafruitfeatherpicoprobe.menu.freq.300=300 MHz (Overclock)
adafruitfeatherpicoprobe.menu.freq.300.build.f_cpu=300000000L
adafruitfeatherpicoprobe.menu.dbgport.Disabled=Disabled
adafruitfeatherpicoprobe.menu.dbgport.Disabled.build.debug_port=
adafruitfeatherpicoprobe.menu.dbgport.Serial=Serial
adafruitfeatherpicoprobe.menu.dbgport.Serial.build.debug_port=-DDEBUG_RP2040_PORT=Serial
adafruitfeatherpicoprobe.menu.dbgport.Serial1=Serial1
adafruitfeatherpicoprobe.menu.dbgport.Serial1.build.debug_port=-DDEBUG_RP2040_PORT=Serial1
adafruitfeatherpicoprobe.menu.dbgport.Serial2=Serial2
adafruitfeatherpicoprobe.menu.dbgport.Serial2.build.debug_port=-DDEBUG_RP2040_PORT=Serial2
adafruitfeatherpicoprobe.menu.dbglvl.None=None
adafruitfeatherpicoprobe.menu.dbglvl.None.build.debug_level=
adafruitfeatherpicoprobe.menu.dbglvl.Core=Core
adafruitfeatherpicoprobe.menu.dbglvl.Core.build.debug_level=-DDEBUG_RP2040_CORE
adafruitfeatherpicoprobe.menu.dbglvl.SPI=SPI
adafruitfeatherpicoprobe.menu.dbglvl.SPI.build.debug_level=-DDEBUG_RP2040_SPI
adafruitfeatherpicoprobe.menu.dbglvl.Wire=Wire
adafruitfeatherpicoprobe.menu.dbglvl.Wire.build.debug_level=DDEBUG_RP2040_WIRE
adafruitfeatherpicoprobe.menu.dbglvl.All=All
adafruitfeatherpicoprobe.menu.dbglvl.All.build.debug_level=-DDEBUG_RP2040_WIRE -DDEBUG_RP2040_SPI -DDEBUG_RP2040_CORE
adafruitfeatherpicoprobe.menu.dbglvl.NDEBUG=NDEBUG
adafruitfeatherpicoprobe.menu.dbglvl.NDEBUG.build.debug_level=-DNDEBUG
generic.name=Generic RP2040
generic.vid.0=0x2e8a
generic.pid.0=0xf00a
generic.build.usbpid=-DSERIALUSB_PID=0xf00a
generic.build.board=GENERIC_RP2040
generic.build.mcu=cortex-m0plus
generic.build.variant=generic
generic.upload.tool=uf2conv
generic.upload.maximum_size=16777216
generic.upload.maximum_data_size=262144
generic.upload.wait_for_upload_port=true
generic.upload.erase_cmd=
generic.serial.disableDTR=false
generic.serial.disableRTS=false
generic.build.f_cpu=125000000
generic.build.led=
generic.build.core=rp2040
generic.build.mcu=rp2040
generic.build.ldscript=memmap_default.ld
generic.menu.flash.16777216_0=16MB (no FS)
generic.menu.flash.16777216_0.upload.maximum_size=16773120
generic.menu.flash.16777216_0.build.flash_length=16773120
generic.menu.flash.16777216_0.build.eeprom_start=285208576
generic.menu.flash.16777216_0.build.fs_start=285208576
generic.menu.flash.16777216_0.build.fs_end=285208576
generic.menu.flash.16777216_65536=16MB (FS: 64KB)
generic.menu.flash.16777216_65536.upload.maximum_size=16707584
generic.menu.flash.16777216_65536.build.flash_length=16707584
generic.menu.flash.16777216_65536.build.eeprom_start=285208576
generic.menu.flash.16777216_65536.build.fs_start=285143040
generic.menu.flash.16777216_65536.build.fs_end=285208576
generic.menu.flash.16777216_131072=16MB (FS: 128KB)
generic.menu.flash.16777216_131072.upload.maximum_size=16642048
generic.menu.flash.16777216_131072.build.flash_length=16642048
generic.menu.flash.16777216_131072.build.eeprom_start=285208576
generic.menu.flash.16777216_131072.build.fs_start=285077504
generic.menu.flash.16777216_131072.build.fs_end=285208576
generic.menu.flash.16777216_262144=16MB (FS: 256KB)
generic.menu.flash.16777216_262144.upload.maximum_size=16510976
generic.menu.flash.16777216_262144.build.flash_length=16510976
generic.menu.flash.16777216_262144.build.eeprom_start=285208576
generic.menu.flash.16777216_262144.build.fs_start=284946432
generic.menu.flash.16777216_262144.build.fs_end=285208576
generic.menu.flash.16777216_524288=16MB (FS: 512KB)
generic.menu.flash.16777216_524288.upload.maximum_size=16248832
generic.menu.flash.16777216_524288.build.flash_length=16248832
generic.menu.flash.16777216_524288.build.eeprom_start=285208576
generic.menu.flash.16777216_524288.build.fs_start=284684288
generic.menu.flash.16777216_524288.build.fs_end=285208576
generic.menu.flash.16777216_1048576=16MB (FS: 1MB)
generic.menu.flash.16777216_1048576.upload.maximum_size=15724544
generic.menu.flash.16777216_1048576.build.flash_length=15724544
generic.menu.flash.16777216_1048576.build.eeprom_start=285208576
generic.menu.flash.16777216_1048576.build.fs_start=284160000
generic.menu.flash.16777216_1048576.build.fs_end=285208576
generic.menu.flash.16777216_2097152=16MB (FS: 2MB)
generic.menu.flash.16777216_2097152.upload.maximum_size=14675968
generic.menu.flash.16777216_2097152.build.flash_length=14675968
generic.menu.flash.16777216_2097152.build.eeprom_start=285208576
generic.menu.flash.16777216_2097152.build.fs_start=283111424
generic.menu.flash.16777216_2097152.build.fs_end=285208576
generic.menu.flash.16777216_3145728=16MB (FS: 3MB)
generic.menu.flash.16777216_3145728.upload.maximum_size=13627392
generic.menu.flash.16777216_3145728.build.flash_length=13627392
generic.menu.flash.16777216_3145728.build.eeprom_start=285208576
generic.menu.flash.16777216_3145728.build.fs_start=282062848
generic.menu.flash.16777216_3145728.build.fs_end=285208576
generic.menu.flash.16777216_4194304=16MB (FS: 4MB)
generic.menu.flash.16777216_4194304.upload.maximum_size=12578816
generic.menu.flash.16777216_4194304.build.flash_length=12578816
generic.menu.flash.16777216_4194304.build.eeprom_start=285208576
generic.menu.flash.16777216_4194304.build.fs_start=281014272
generic.menu.flash.16777216_4194304.build.fs_end=285208576
generic.menu.flash.16777216_5242880=16MB (FS: 5MB)
generic.menu.flash.16777216_5242880.upload.maximum_size=11530240
generic.menu.flash.16777216_5242880.build.flash_length=11530240
generic.menu.flash.16777216_5242880.build.eeprom_start=285208576
generic.menu.flash.16777216_5242880.build.fs_start=279965696
generic.menu.flash.16777216_5242880.build.fs_end=285208576
generic.menu.flash.16777216_6291456=16MB (FS: 6MB)
generic.menu.flash.16777216_6291456.upload.maximum_size=10481664
generic.menu.flash.16777216_6291456.build.flash_length=10481664
generic.menu.flash.16777216_6291456.build.eeprom_start=285208576
generic.menu.flash.16777216_6291456.build.fs_start=278917120
generic.menu.flash.16777216_6291456.build.fs_end=285208576
generic.menu.flash.16777216_7340032=16MB (FS: 7MB)
generic.menu.flash.16777216_7340032.upload.maximum_size=9433088
generic.menu.flash.16777216_7340032.build.flash_length=9433088
generic.menu.flash.16777216_7340032.build.eeprom_start=285208576
generic.menu.flash.16777216_7340032.build.fs_start=277868544
generic.menu.flash.16777216_7340032.build.fs_end=285208576
generic.menu.flash.16777216_8388608=16MB (FS: 8MB)
generic.menu.flash.16777216_8388608.upload.maximum_size=8384512
generic.menu.flash.16777216_8388608.build.flash_length=8384512
generic.menu.flash.16777216_8388608.build.eeprom_start=285208576
generic.menu.flash.16777216_8388608.build.fs_start=276819968
generic.menu.flash.16777216_8388608.build.fs_end=285208576
generic.menu.flash.16777216_9437184=16MB (FS: 9MB)
generic.menu.flash.16777216_9437184.upload.maximum_size=7335936
generic.menu.flash.16777216_9437184.build.flash_length=7335936
generic.menu.flash.16777216_9437184.build.eeprom_start=285208576
generic.menu.flash.16777216_9437184.build.fs_start=275771392
generic.menu.flash.16777216_9437184.build.fs_end=285208576
generic.menu.flash.16777216_10485760=16MB (FS: 10MB)
generic.menu.flash.16777216_10485760.upload.maximum_size=6287360
generic.menu.flash.16777216_10485760.build.flash_length=6287360
generic.menu.flash.16777216_10485760.build.eeprom_start=285208576
generic.menu.flash.16777216_10485760.build.fs_start=274722816
generic.menu.flash.16777216_10485760.build.fs_end=285208576
generic.menu.flash.16777216_11534336=16MB (FS: 11MB)
generic.menu.flash.16777216_11534336.upload.maximum_size=5238784
generic.menu.flash.16777216_11534336.build.flash_length=5238784
generic.menu.flash.16777216_11534336.build.eeprom_start=285208576
generic.menu.flash.16777216_11534336.build.fs_start=273674240
generic.menu.flash.16777216_11534336.build.fs_end=285208576
generic.menu.flash.16777216_12582912=16MB (FS: 12MB)
generic.menu.flash.16777216_12582912.upload.maximum_size=4190208
generic.menu.flash.16777216_12582912.build.flash_length=4190208
generic.menu.flash.16777216_12582912.build.eeprom_start=285208576
generic.menu.flash.16777216_12582912.build.fs_start=272625664
generic.menu.flash.16777216_12582912.build.fs_end=285208576
generic.menu.flash.16777216_13631488=16MB (FS: 13MB)
generic.menu.flash.16777216_13631488.upload.maximum_size=3141632
generic.menu.flash.16777216_13631488.build.flash_length=3141632
generic.menu.flash.16777216_13631488.build.eeprom_start=285208576
generic.menu.flash.16777216_13631488.build.fs_start=271577088
generic.menu.flash.16777216_13631488.build.fs_end=285208576
generic.menu.flash.16777216_14680064=16MB (FS: 14MB)
generic.menu.flash.16777216_14680064.upload.maximum_size=2093056
generic.menu.flash.16777216_14680064.build.flash_length=2093056
generic.menu.flash.16777216_14680064.build.eeprom_start=285208576
generic.menu.flash.16777216_14680064.build.fs_start=270528512
generic.menu.flash.16777216_14680064.build.fs_end=285208576
generic.menu.flash.16777216_15728640=16MB (FS: 15MB)
generic.menu.flash.16777216_15728640.upload.maximum_size=1044480
generic.menu.flash.16777216_15728640.build.flash_length=1044480
generic.menu.flash.16777216_15728640.build.eeprom_start=285208576
generic.menu.flash.16777216_15728640.build.fs_start=269479936
generic.menu.flash.16777216_15728640.build.fs_end=285208576
generic.menu.freq.125=125 MHz
generic.menu.freq.125.build.f_cpu=125000000L
generic.menu.freq.50=50 MHz
generic.menu.freq.50.build.f_cpu=50000000L
generic.menu.freq.100=100 MHz
generic.menu.freq.100.build.f_cpu=100000000L
generic.menu.freq.133=133 MHz
generic.menu.freq.133.build.f_cpu=133000000L
generic.menu.freq.150=150 MHz (Overclock)
generic.menu.freq.150.build.f_cpu=150000000L
generic.menu.freq.175=175 MHz (Overclock)
generic.menu.freq.175.build.f_cpu=175000000L
generic.menu.freq.200=200 MHz (Overclock)
generic.menu.freq.200.build.f_cpu=200000000L
generic.menu.freq.225=225 MHz (Overclock)
generic.menu.freq.225.build.f_cpu=225000000L
generic.menu.freq.250=250 MHz (Overclock)
generic.menu.freq.250.build.f_cpu=250000000L
generic.menu.freq.275=275 MHz (Overclock)
generic.menu.freq.275.build.f_cpu=275000000L
generic.menu.freq.300=300 MHz (Overclock)
generic.menu.freq.300.build.f_cpu=300000000L
generic.menu.dbgport.Disabled=Disabled
generic.menu.dbgport.Disabled.build.debug_port=
generic.menu.dbgport.Serial=Serial
generic.menu.dbgport.Serial.build.debug_port=-DDEBUG_RP2040_PORT=Serial
generic.menu.dbgport.Serial1=Serial1
generic.menu.dbgport.Serial1.build.debug_port=-DDEBUG_RP2040_PORT=Serial1
generic.menu.dbgport.Serial2=Serial2
