earlephilhower/arduino-pico/boards.txt
generic.menu.dbgport.Serial2.build.debug_port=-DDEBUG_RP2040_PORT=Serial2
generic.menu.dbglvl.None=None
generic.menu.dbglvl.None.build.debug_level=
generic.menu.dbglvl.Core=Core
generic.menu.dbglvl.Core.build.debug_level=-DDEBUG_RP2040_CORE
generic.menu.dbglvl.SPI=SPI
generic.menu.dbglvl.SPI.build.debug_level=-DDEBUG_RP2040_SPI
generic.menu.dbglvl.Wire=Wire
generic.menu.dbglvl.Wire.build.debug_level=DDEBUG_RP2040_WIRE
generic.menu.dbglvl.All=All
generic.menu.dbglvl.All.build.debug_level=-DDEBUG_RP2040_WIRE -DDEBUG_RP2040_SPI -DDEBUG_RP2040_CORE
generic.menu.dbglvl.NDEBUG=NDEBUG
generic.menu.dbglvl.NDEBUG.build.debug_level=-DNDEBUG
genericpicoprobe.name=Generic RP2040 (Picoprobe)
genericpicoprobe.vid.0=0x2e8a
genericpicoprobe.pid.0=0xf00a
genericpicoprobe.build.usbpid=-DSERIALUSB_PID=0xf00a
genericpicoprobe.build.board=GENERIC_RP2040
genericpicoprobe.build.mcu=cortex-m0plus
genericpicoprobe.build.variant=generic
genericpicoprobe.upload.tool=picoprobe
genericpicoprobe.upload.maximum_size=16777216
genericpicoprobe.upload.maximum_data_size=262144
genericpicoprobe.upload.wait_for_upload_port=true
genericpicoprobe.upload.erase_cmd=
genericpicoprobe.serial.disableDTR=false
genericpicoprobe.serial.disableRTS=false
genericpicoprobe.build.f_cpu=125000000
genericpicoprobe.build.led=
genericpicoprobe.build.core=rp2040
genericpicoprobe.build.mcu=rp2040
genericpicoprobe.build.ldscript=memmap_default.ld
genericpicoprobe.menu.flash.16777216_0=16MB (no FS)
genericpicoprobe.menu.flash.16777216_0.upload.maximum_size=16773120
genericpicoprobe.menu.flash.16777216_0.build.flash_length=16773120
genericpicoprobe.menu.flash.16777216_0.build.eeprom_start=285208576
genericpicoprobe.menu.flash.16777216_0.build.fs_start=285208576
genericpicoprobe.menu.flash.16777216_0.build.fs_end=285208576
genericpicoprobe.menu.flash.16777216_65536=16MB (FS: 64KB)
genericpicoprobe.menu.flash.16777216_65536.upload.maximum_size=16707584
genericpicoprobe.menu.flash.16777216_65536.build.flash_length=16707584
genericpicoprobe.menu.flash.16777216_65536.build.eeprom_start=285208576
genericpicoprobe.menu.flash.16777216_65536.build.fs_start=285143040
genericpicoprobe.menu.flash.16777216_65536.build.fs_end=285208576
genericpicoprobe.menu.flash.16777216_131072=16MB (FS: 128KB)
genericpicoprobe.menu.flash.16777216_131072.upload.maximum_size=16642048
genericpicoprobe.menu.flash.16777216_131072.build.flash_length=16642048
genericpicoprobe.menu.flash.16777216_131072.build.eeprom_start=285208576
genericpicoprobe.menu.flash.16777216_131072.build.fs_start=285077504
genericpicoprobe.menu.flash.16777216_131072.build.fs_end=285208576
genericpicoprobe.menu.flash.16777216_262144=16MB (FS: 256KB)
genericpicoprobe.menu.flash.16777216_262144.upload.maximum_size=16510976
genericpicoprobe.menu.flash.16777216_262144.build.flash_length=16510976
genericpicoprobe.menu.flash.16777216_262144.build.eeprom_start=285208576
genericpicoprobe.menu.flash.16777216_262144.build.fs_start=284946432
genericpicoprobe.menu.flash.16777216_262144.build.fs_end=285208576
genericpicoprobe.menu.flash.16777216_524288=16MB (FS: 512KB)
genericpicoprobe.menu.flash.16777216_524288.upload.maximum_size=16248832
genericpicoprobe.menu.flash.16777216_524288.build.flash_length=16248832
genericpicoprobe.menu.flash.16777216_524288.build.eeprom_start=285208576
genericpicoprobe.menu.flash.16777216_524288.build.fs_start=284684288
genericpicoprobe.menu.flash.16777216_524288.build.fs_end=285208576
genericpicoprobe.menu.flash.16777216_1048576=16MB (FS: 1MB)
genericpicoprobe.menu.flash.16777216_1048576.upload.maximum_size=15724544
genericpicoprobe.menu.flash.16777216_1048576.build.flash_length=15724544
genericpicoprobe.menu.flash.16777216_1048576.build.eeprom_start=285208576
genericpicoprobe.menu.flash.16777216_1048576.build.fs_start=284160000
genericpicoprobe.menu.flash.16777216_1048576.build.fs_end=285208576
genericpicoprobe.menu.flash.16777216_2097152=16MB (FS: 2MB)
genericpicoprobe.menu.flash.16777216_2097152.upload.maximum_size=14675968
genericpicoprobe.menu.flash.16777216_2097152.build.flash_length=14675968
genericpicoprobe.menu.flash.16777216_2097152.build.eeprom_start=285208576
genericpicoprobe.menu.flash.16777216_2097152.build.fs_start=283111424
genericpicoprobe.menu.flash.16777216_2097152.build.fs_end=285208576
genericpicoprobe.menu.flash.16777216_3145728=16MB (FS: 3MB)
genericpicoprobe.menu.flash.16777216_3145728.upload.maximum_size=13627392
genericpicoprobe.menu.flash.16777216_3145728.build.flash_length=13627392
genericpicoprobe.menu.flash.16777216_3145728.build.eeprom_start=285208576
genericpicoprobe.menu.flash.16777216_3145728.build.fs_start=282062848
genericpicoprobe.menu.flash.16777216_3145728.build.fs_end=285208576
genericpicoprobe.menu.flash.16777216_4194304=16MB (FS: 4MB)
genericpicoprobe.menu.flash.16777216_4194304.upload.maximum_size=12578816
genericpicoprobe.menu.flash.16777216_4194304.build.flash_length=12578816
genericpicoprobe.menu.flash.16777216_4194304.build.eeprom_start=285208576
genericpicoprobe.menu.flash.16777216_4194304.build.fs_start=281014272
genericpicoprobe.menu.flash.16777216_4194304.build.fs_end=285208576
genericpicoprobe.menu.flash.16777216_5242880=16MB (FS: 5MB)
genericpicoprobe.menu.flash.16777216_5242880.upload.maximum_size=11530240
genericpicoprobe.menu.flash.16777216_5242880.build.flash_length=11530240
genericpicoprobe.menu.flash.16777216_5242880.build.eeprom_start=285208576
genericpicoprobe.menu.flash.16777216_5242880.build.fs_start=279965696
genericpicoprobe.menu.flash.16777216_5242880.build.fs_end=285208576
genericpicoprobe.menu.flash.16777216_6291456=16MB (FS: 6MB)
genericpicoprobe.menu.flash.16777216_6291456.upload.maximum_size=10481664
genericpicoprobe.menu.flash.16777216_6291456.build.flash_length=10481664
genericpicoprobe.menu.flash.16777216_6291456.build.eeprom_start=285208576
genericpicoprobe.menu.flash.16777216_6291456.build.fs_start=278917120
genericpicoprobe.menu.flash.16777216_6291456.build.fs_end=285208576
genericpicoprobe.menu.flash.16777216_7340032=16MB (FS: 7MB)
genericpicoprobe.menu.flash.16777216_7340032.upload.maximum_size=9433088
genericpicoprobe.menu.flash.16777216_7340032.build.flash_length=9433088
genericpicoprobe.menu.flash.16777216_7340032.build.eeprom_start=285208576
genericpicoprobe.menu.flash.16777216_7340032.build.fs_start=277868544
genericpicoprobe.menu.flash.16777216_7340032.build.fs_end=285208576
genericpicoprobe.menu.flash.16777216_8388608=16MB (FS: 8MB)
genericpicoprobe.menu.flash.16777216_8388608.upload.maximum_size=8384512
genericpicoprobe.menu.flash.16777216_8388608.build.flash_length=8384512
genericpicoprobe.menu.flash.16777216_8388608.build.eeprom_start=285208576
genericpicoprobe.menu.flash.16777216_8388608.build.fs_start=276819968
genericpicoprobe.menu.flash.16777216_8388608.build.fs_end=285208576
genericpicoprobe.menu.flash.16777216_9437184=16MB (FS: 9MB)
genericpicoprobe.menu.flash.16777216_9437184.upload.maximum_size=7335936
genericpicoprobe.menu.flash.16777216_9437184.build.flash_length=7335936
genericpicoprobe.menu.flash.16777216_9437184.build.eeprom_start=285208576
genericpicoprobe.menu.flash.16777216_9437184.build.fs_start=275771392
genericpicoprobe.menu.flash.16777216_9437184.build.fs_end=285208576
genericpicoprobe.menu.flash.16777216_10485760=16MB (FS: 10MB)
genericpicoprobe.menu.flash.16777216_10485760.upload.maximum_size=6287360
genericpicoprobe.menu.flash.16777216_10485760.build.flash_length=6287360
genericpicoprobe.menu.flash.16777216_10485760.build.eeprom_start=285208576
genericpicoprobe.menu.flash.16777216_10485760.build.fs_start=274722816
genericpicoprobe.menu.flash.16777216_10485760.build.fs_end=285208576
genericpicoprobe.menu.flash.16777216_11534336=16MB (FS: 11MB)
genericpicoprobe.menu.flash.16777216_11534336.upload.maximum_size=5238784
genericpicoprobe.menu.flash.16777216_11534336.build.flash_length=5238784
genericpicoprobe.menu.flash.16777216_11534336.build.eeprom_start=285208576
genericpicoprobe.menu.flash.16777216_11534336.build.fs_start=273674240
genericpicoprobe.menu.flash.16777216_11534336.build.fs_end=285208576
genericpicoprobe.menu.flash.16777216_12582912=16MB (FS: 12MB)
genericpicoprobe.menu.flash.16777216_12582912.upload.maximum_size=4190208
genericpicoprobe.menu.flash.16777216_12582912.build.flash_length=4190208
genericpicoprobe.menu.flash.16777216_12582912.build.eeprom_start=285208576
genericpicoprobe.menu.flash.16777216_12582912.build.fs_start=272625664
genericpicoprobe.menu.flash.16777216_12582912.build.fs_end=285208576
genericpicoprobe.menu.flash.16777216_13631488=16MB (FS: 13MB)
genericpicoprobe.menu.flash.16777216_13631488.upload.maximum_size=3141632
genericpicoprobe.menu.flash.16777216_13631488.build.flash_length=3141632
genericpicoprobe.menu.flash.16777216_13631488.build.eeprom_start=285208576
genericpicoprobe.menu.flash.16777216_13631488.build.fs_start=271577088
genericpicoprobe.menu.flash.16777216_13631488.build.fs_end=285208576
genericpicoprobe.menu.flash.16777216_14680064=16MB (FS: 14MB)
genericpicoprobe.menu.flash.16777216_14680064.upload.maximum_size=2093056
genericpicoprobe.menu.flash.16777216_14680064.build.flash_length=2093056
genericpicoprobe.menu.flash.16777216_14680064.build.eeprom_start=285208576
genericpicoprobe.menu.flash.16777216_14680064.build.fs_start=270528512
genericpicoprobe.menu.flash.16777216_14680064.build.fs_end=285208576
genericpicoprobe.menu.flash.16777216_15728640=16MB (FS: 15MB)
genericpicoprobe.menu.flash.16777216_15728640.upload.maximum_size=1044480
genericpicoprobe.menu.flash.16777216_15728640.build.flash_length=1044480
genericpicoprobe.menu.flash.16777216_15728640.build.eeprom_start=285208576
genericpicoprobe.menu.flash.16777216_15728640.build.fs_start=269479936
genericpicoprobe.menu.flash.16777216_15728640.build.fs_end=285208576
genericpicoprobe.menu.freq.125=125 MHz
genericpicoprobe.menu.freq.125.build.f_cpu=125000000L
genericpicoprobe.menu.freq.50=50 MHz
genericpicoprobe.menu.freq.50.build.f_cpu=50000000L
genericpicoprobe.menu.freq.100=100 MHz
genericpicoprobe.menu.freq.100.build.f_cpu=100000000L
genericpicoprobe.menu.freq.133=133 MHz
genericpicoprobe.menu.freq.133.build.f_cpu=133000000L
genericpicoprobe.menu.freq.150=150 MHz (Overclock)
genericpicoprobe.menu.freq.150.build.f_cpu=150000000L
genericpicoprobe.menu.freq.175=175 MHz (Overclock)
genericpicoprobe.menu.freq.175.build.f_cpu=175000000L
genericpicoprobe.menu.freq.200=200 MHz (Overclock)
genericpicoprobe.menu.freq.200.build.f_cpu=200000000L
genericpicoprobe.menu.freq.225=225 MHz (Overclock)
genericpicoprobe.menu.freq.225.build.f_cpu=225000000L
genericpicoprobe.menu.freq.250=250 MHz (Overclock)
genericpicoprobe.menu.freq.250.build.f_cpu=250000000L
genericpicoprobe.menu.freq.275=275 MHz (Overclock)
genericpicoprobe.menu.freq.275.build.f_cpu=275000000L
genericpicoprobe.menu.freq.300=300 MHz (Overclock)
genericpicoprobe.menu.freq.300.build.f_cpu=300000000L
genericpicoprobe.menu.dbgport.Disabled=Disabled
genericpicoprobe.menu.dbgport.Disabled.build.debug_port=
genericpicoprobe.menu.dbgport.Serial=Serial
genericpicoprobe.menu.dbgport.Serial.build.debug_port=-DDEBUG_RP2040_PORT=Serial
genericpicoprobe.menu.dbgport.Serial1=Serial1
genericpicoprobe.menu.dbgport.Serial1.build.debug_port=-DDEBUG_RP2040_PORT=Serial1
genericpicoprobe.menu.dbgport.Serial2=Serial2
genericpicoprobe.menu.dbgport.Serial2.build.debug_port=-DDEBUG_RP2040_PORT=Serial2
genericpicoprobe.menu.dbglvl.None=None
genericpicoprobe.menu.dbglvl.None.build.debug_level=
genericpicoprobe.menu.dbglvl.Core=Core
genericpicoprobe.menu.dbglvl.Core.build.debug_level=-DDEBUG_RP2040_CORE
genericpicoprobe.menu.dbglvl.SPI=SPI
genericpicoprobe.menu.dbglvl.SPI.build.debug_level=-DDEBUG_RP2040_SPI
genericpicoprobe.menu.dbglvl.Wire=Wire
genericpicoprobe.menu.dbglvl.Wire.build.debug_level=DDEBUG_RP2040_WIRE
genericpicoprobe.menu.dbglvl.All=All
genericpicoprobe.menu.dbglvl.All.build.debug_level=-DDEBUG_RP2040_WIRE -DDEBUG_RP2040_SPI -DDEBUG_RP2040_CORE
genericpicoprobe.menu.dbglvl.NDEBUG=NDEBUG
genericpicoprobe.menu.dbglvl.NDEBUG.build.debug_level=-DNDEBUG
